# IPointSetIterator Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPointSetIterator Interface
Members See Also
---
An interface that Revit will call when iterating through sets of points on the engine.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public interface IPointSetIterator
```

Visual Basic
---
```text
Public Interface IPointSetIterator
```

Visual C++
---
```text
public interface class IPointSetIterator
```

# Remarks
An instance of this interface is obtained from the Point Cloud engine when the engine's CreatePointSetIterator method is called.
# See Also
IPointSetIterator Members
Autodesk.Revit.DB.PointClouds Namespace